#include <iostream>

using namespace std;

int main()
{
	setlocale(0, "");
	int num = 0;
	int a = 0;
	cout << "Какого из азотистых оснований нет в ДНК? " << '\n' << "1) Аденин " << '\n' << "2) Тимин" << '\n' << "3) Гуанин" << '\n' << "4) Урацил"<< endl;
	cin >> a;
	if (a == 4)
		num = num + 1;
	cout << "В каком году состоялась Куликовская битва? " << '\n' << "1) 1566 " << '\n' << "2) 1380" << '\n' << "3) 981" << '\n' << "4) 1232"<< endl;
	cin >> a;
	if (a == 2)
		num = num + 1;
	cout << "Какая столица Аргентины? " << '\n' << "1) Буэнос-Айрес " << '\n' << "2) Москва" << '\n' << "3) Лиссабон" << '\n' << "4) Хельсинки" << endl;
	cin >> a;
	if (a == 1)
		num = num + 1;
	cout << "Действующий чемпион мира по шахматам? " << '\n' << "1) Гарри Каспаров " << '\n' << "2) Магнус Карлсон" << '\n' << "3) Бобби Фишер" << '\n' << "4) Ян Непомнящий" << endl;
	cin >> a;
	if (a == 2)
		num = num + 1;
	cout << "Сколько хромосом у человека " << '\n' << "1) 46 " << '\n' << "2) 23" << '\n' << "3) 56" << '\n' << "4) 34" << endl;
	cin >> a;
	if (a == 1)
		num = num + 1;
	cout << "количество верных ответов: " << num;
	return 0;
}
